{
  "attribution": {
    "template": "Start Bootstrap",
    "templatelink": "https://startbootstrap.com/themes/resume/",
    "inspiration": "Oleg Agapov",
    "inspirationlink": "https://olegagapov.com/"
  },
  "about": {
    "scriptlink": "https://script.google.com/macros/s/AKfycbx5Cgfybr7cGRkexvR_SP5hJvTEayi5ry-UcMF5/exec",
    "firstName": "Will",
    "lastName": "Peracchio",
    "phone": "+1 (732) 713-9493",
    "formattedPhone": "1-732-713-9493",
    "email": "waperacchio@gmail.com",
    "address": {
      "streetAddress": "2365 Apple Ridge Circle",
      "city": "Manasquan",
      "state": "NJ",
      "zip": "08736"
    },
    "socialmedia": {
      "linkedin": "https://www.linkedin.com/in/william-peracchio/",
      "github": "https://github.com/willperacchio/",
      "twitter": null,
      "facebook": null
    },
    "options": [
      "I wanted to reach out about career opportunities",
      "I'm interested in your technical skills",
      "Tell me more about Preff...",
      "Not sure why I'm here actually..."
    ],
    "bio": [
      "I surround myself with people who are smarter than me to learn from them. I'm motivated and determined to always better myself, and I bring out the best in others because I know that brings out the best in me.",
      "I'm driven to learn and persistently curious about business, computer science, and data analysis. I love applying the theory of computer science, math, and statistics to real-world business applications.",
      "I'm entering into my senior year at Lehigh University, and am interested in internship opportunities in business and technology."
    ],
    "resume": "resume.pdf",
    "carousel": [
      { 
        "image": "pwc.jpg", 
        "alt": "pwc", 
        "title" : "PwC",
        "description": "Working at PwC" 
      }
    ]
  },
  "education": [
    {
      "name": "Lehigh University",
      "sankey": "lehigh_sankeymatic.png",
      "degrees": [
        { 
          "degree": "Master of Science", 
          "expected": "May 2021",
          "status": "current",
          "major": [ 
            {
              "title": "Computer Science",
              "description": "After finishing my undergrad in 3.5 years, I plan on going into graduate school, where I will get my graduate degree in one semester. I plan on concentrating my MS in CS in the areas of data analytics, algorithm design, and machine learning."
            }
          ],
          "courses": [
            {
              "title": "Business Analytics for Decision Making",
              "code": "BIS 456",
              "description": "Provides students with a theoretical and practical understanding of core data analytics concepts and techniques, and develops hands-on experience in applying these techniques to practical real-word business problems using R software. As an applied course, the emphasis will be less on the inner working of each method and more on when and how to use each technique and how to interpret the results."
            },
            {
              "title": "Network Security",
              "code": "CSE 343",
              "description": "Overview of network security threats and vulnerabilities. Techniques and tools for detecting, responding to and recovering from security incidents. Fundamentals of cryptography. Hands-on experience with programming techniques for security protocols."
            },
            {
              "title": "Data Mining",
              "code": "CSE 347",
              "description": "Overview of modern data mining techniques: data cleaning; attribute and subset selection; model construction, evaluation and application. Fundamental mathematics and algorithms for decision trees, covering algorithms, association mining, statistical modeling, linear models, neural networks, instance-based learning and clustering covered. Practical design, implementation, application, and evaluation of data mining techniques in class projects."
            }
          ]
        },
        {
          "degree": "Bachelor of Science",
          "expected": "Jan. 2021",
          "status": "current",
          "major": [
            {
              "title": "Computer Science & Business",
              "description": "The Computer Science & Business program is a special program at Lehigh that is both ABET and AACSB accredited, meaning it is a full computer science and full business degree. I learn everything a computer science student learns, everything a business major learns, and how these disciplines interact in the modern world."
            }
          ],
          "minor": [
            {
              "title": "Data Science",
              "description": "Data Science is an interdisciplinary field that combines areas of computer science, statistics, and other fields to extract information from large sets of structured and unstructured data."
            },
            {
              "title": "Economics",
              "description": "Though economics is variously defined, modern-day definitions generally suggest that it is the study of the principles that govern the efficient allocation of resources.  One of the greatest of the 19th century economists who did much to uncover these principles suggested a broader definition.  Alfred Marshall described economics as “a study of mankind in the ordinary business of life and a part of the study of man.”"
            },
            {
              "title": "Entrepreneurship",
              "description": "Entrepreneurial thinking is a process of utilizing empathy to solve other's problems, whether it be through starting a new business or just working through a difficult problem."
            }
          ],
          "certificate": [
            {
              "title": "Global Citizenship",
              "description": "Global Citizenship emphasizes critical thinking about our values in our increasingly globalized world. Lehigh's Global Citizenship Program is an interdisciplinary certificate program offered to undergraduates across all colleges, and has a final capstone project that engages in the local community."
            }
          ],
          "gpa": {
            "cumulative": "3.97",
            "major": "3.98",
            "scale": "4.00"
          },
          "courses": [ 
            {
              "title": "Programming and Data Structures",
              "code": "CSE 017",
              "description": "Algorithmic design and implementation in a high level, object oriented language, such as Java. Topics include classes, subclasses, recursion, searching, sorting, linked lists, trees, stacks, queues."
            },
            {
              "title": "Women in Technology Seminar",
              "code": "CSE 098",
              "description": "A seminar that focuses on the gender-related inclusion issues that are sadly still present in the technology industry. Lectures feature discussions with the class and guest speakers, as well as a mentorship program, and a reflective analysis of the course as a whole."
            },
            {
              "title": "Intro to Data Science",
              "code": "CSE 160",
              "description": "Data Science is a fast-growing interdisciplinary field, focusing on the computational analysis of data to extract knowledge and insight. Collection, preparation, analysis, modeling, and visualization of data, covering both conceptual and practical issues. Examples from diverse fields and hands-on use of statistical and data manipulation software."
            },
            {
              "title": "Blockchain Algorithms",
              "code": "CSE 297",
              "description": "Focus on the technical implementation of blockchains and distributed ledger technologies, encryption and the math behind them, and implementation details for different blockchain design patterns. Course includes developing smart contracts via Ethereum."
            },
            {
              "title": "Software Engineering",
              "code": "CSE 216",
              "description": "The software lifecycle; lifecycle models; software planning; testing; specification methods; maintenance. Emphasis on team work and large-scale software systems, including oral presentations and written reports."
            },
            {
              "title": "Design & Analysis of Algorithms",
              "code": "CSE 340",
              "description": "Focus on algorithmic design and growth. Includes topics about algorithms for searching, sorting, manipulating graphs and trees, finding shortest paths and minimum spanning trees, scheduling tasks, etc. proofs of their correctness and analysis of their asymptotic runtime and memory demands. Designing algorithms: recursion, divide-and-conquer, greediness, dynamic programming. Limits on algorithm efficiency using elementary NP-completeness theory."
            },
            {
              "title": "Database Systems, Algorithms, and Applications",
              "code": "CSE 341",
              "description": "Design of large databases; normalization; query languages (including SQL); Transaction-processing protocols; Query optimization; performance tuning; distributed systems."
            },
            {
              "title": "Computer Applications in Business",
              "code": "CSB 311",
              "description": "The application of computer technology to solving business problems. Focus areas of the course include: transaction processing systems that support the revenue, conversion, and expenditure cycles of manufacturing, service, and retail business organizations. Topics include process modeling, data modeling, internal controls, corporate IT governance, IT audit techniques, SAP and application of Generalized Audit Software."
            },
            {
              "title": "Design of Integrated Business Applications I",
              "code": "CSB 312",
              "description": "Industry-based business information systems design project. Information systems design methodology, user needs analysis, project feasibility analysis of design alternatives, and integrated product development methodology. Formal oral and written presentations to clients."
            },
            {
              "title": "Entrepreneurial Ventures Capstone - The Garage",
              "code": "ENTP 311",
              "description": "A class with faculty advisors and alumni mentors on marketing, financial planning, and economic and technical feasibility of entrepreneurial product- or service-based new ventures, commercial or non-profit. The classwork features oral presentations, the writing of new venture plans and discussions with guest speakers."
            },
            {
              "title": "Strategic Management in a Global Environment",
              "code": "MGT 301",
              "description": "The capstone business class, integrating concepts and practices from core business classes, utilizing an organization-wide, strategic perspective and examining the relationship among firm strategy, structure and environment. Course emphasizes strategic analysis, strategy formulation, and strategy implementation to achieve sustainable competitive advantage. Corporate governance, corporate social responsibility and business ethics are incorporated into the strategic perspective. Case analyses and competitive simulation game are central learning components."
            }
          ]
        }
      ],
      "startDate": "Aug. 2017",
      "endDate": "May 2021",
      "status": "current"
    },
    {
      "name": "High Technology High School",
      "degrees": [
        {
          "description": [
            {
            "text": "High Technology High School is a pre-engineering career academy that emphasizes the interconnections among mathematics, science, technology and the humanities, prepares students to become proactive and creative problem solvers, effective communicators, and tomorrow's leaders through a rigorous, specialized curriculum and collaborative partnerships."
            }
          ],
          "gpa": {
            "cumulative": "98.21",
            "scale": "100.00 (Unweighted)"
          }
        }
      ],
      "startDate": "Sept. 2013",
      "endDate": "June 2017",
      "status": "complete"
    }
  ],
  "experience": [
    {
      "role": "Software Engineering Intern",
      "company": "Microsoft - Cloud + AI Business Unit: Azure Compute Division",
      "status": "current",
      "startDate": "June 2020",
      "endDate": "Aug. 2020",
      "bullets": [
        "In preparation for my internship, I became Microsoft Certified in Azure Fundamentals (AZ-900) this past May",
        "This summer, I'll be working on products that will be used in the Microsoft Azure Cloud."
      ]
    },
    {
      "role": "Software Development Intern",
      "company": "OSIsoft, LLC.",
      "status": "complete",
      "startDate": "June 2019",
      "endDate": "Aug. 2019",
      "bullets": [
        "Developed in Angular 7 on the next generation of the PI Visualization software, working on UI, data processing, and testing areas",
        "Worked in an Agile - Scrum environment, including running stand-ups for a team of 9 and presenting at project-wide sprint review meetings",
        "Completed an average of 15 Kanban-style effort points per sprint, improving the team's average velocity metric by 26%"
      ]
    },
    {
      "role": "Blockchain Research Intern",
      "company": "PwC Czech Republic",
      "status": "complete",
      "startDate": "May 2019",
      "endDate": "June 2019",
      "bullets": [
        "Evaluated different enterprise blockchain and distributed ledger technology solutions for internal and external use for PwC Czech Republic’s Assurance department",
        "Developed a plugin using VBA and Hyperledger Composer for Microsoft Excel that allows for workbooks to export to and import from a distributed Hyperledger Fabric network"
      ]
    },
    {
      "role": "Engineering Intern",
      "company": "Commvault",
      "status": "complete",
      "startDate": "Sept. 2016",
      "endDate": "Jan. 2017",
      "bullets": [
        "Developed localization script for global logistical reporting using Python’s XML ElementTree",
        "Detected and analyzed coding bugs and algorithmic efficiency in pre-existing programs"
      ]
    }
  ],
  "skills": {
    "catalog": [
      {
        "id": "HTML",
        "title": "HTML5",
        "icon": "fab fa-html5",
        "description": [
          "HTML is the basis for every web page. It's a minimal, easy-to-understand, styling markup and is often one of the first technologies programmers are exposed to.",
          "I find it as a phenomenal entry point for learning computer science, as it's a straightforward, visual representation of the power of computers - and serves as the underlying foundation for the internet."
        ],
        "link": "https://en.wikipedia.org/wiki/HTML",
        "subheading": "The structure of the web",
        "progress": "70",
        "level": "Proficient"
      },
      {
        "id": "CSS",
        "title": "CSS3",
        "icon": "fab fa-css3-alt",
        "description": [
          "Cascading Style Sheets (CSS) is inseperably linked to HTML. It provides the basis for styling on the web.",
          "CSS can take a plain-looking HTML site, and add colors and formatting to make it more visually appealing. CSS is the reason that every website doesn't look the same."
        ],
        "link": "https://en.wikipedia.org/wiki/Cascading_Style_Sheets",
        "subheading": "The style of the web",
        "progress": "70",
        "level": "Proficient"
      },
      {
        "id": "JS",
        "title": "JavaScript ES6+",
        "icon": "fab fa-js-square",
        "description": [
          "JavaScript is the action for the web, and allows for more dynamic webpages and animations. It's a powerful, flexible language; also, JavaScript is not the same as Java!",
          "JavaScript is increasingly being managed through front-end frameworks such as Angular, React, and Vue, as well as for backend development through NodeJS."
        ],
        "link": "https://en.wikipedia.org/wiki/JavaScript",
        "subheading": "The Action of the Web",
        "progress": "70",
        "level": "Proficient"
      },
      {
        "id": "Vue",
        "title": "Vue",
        "icon": "fab fa-vuejs",
        "description": [
          "Vue is a front-end framework for managing application state. Vue is simple to learn, but powerful.",
          "I highly recommend Vue as your introductory front-end framework, as it is easier to learn than both Angular and React. This site is utilizes Vue to render."
        ],
        "link": "https://vuejs.org/",
        "subheading": "Micro-management made easy",
        "progress": "60",
        "level": "Proficient"
      },
      {
        "id": "Angular",
        "title": "Angular",
        "icon": "fab fa-angular",
        "description": [
          "Angular is a front-end framework for managing application state maintained by Google. Angular comes built-in with many different features, which can make it a little bulky but powerful.",
          "Angular scales well for large organizations, as it has a well-developed module system. I worked in Angular at my internship at OSIsoft, and found it to be very intuitive after an initial learning curve."
        ],
        "link": "https://angular.io/",
        "subheading": "Grow in scale, not complexity",
        "progress": "60",
        "level": "Proficient"
      },
      {
        "id": "React",
        "title": "React",
        "icon": "fab fa-react",
        "description": [
          "React is a front-end framework for managing application state maintained by Facebook. Unlike Angular (and to a lesser extent Vue), React is much more minimalist and has compartively fewer features out-of-the-box.",
          "React is extremely powerful and performant, but I would recommend checking out React after getting comfortable in either Angular or Vue."
        ],
        "link": "https://reactjs.org/",
        "subheading": "React to change",
        "progress": "30",
        "level": "Familiar"
      },
      {
        "id": "Sass",
        "title": "Sass",
        "icon": "fab fa-sass",
        "description": [
          "Sass is a CSS prepreprocessor that makes managing application styling easy. As applications scale, making sure styles stay consistent can be difficult to manage, which is where Sass comes in.",
          "Sass is a simple tool that generates the necessary CSS for your project while making it easier to maintain."
        ],
        "link": "https://sass-lang.com/",
        "subheading": "Style that scales",
        "progress": "50",
        "level": "Familiar"
      },
      {
        "id": "Bootstrap",
        "title": "Bootstrap 4",
        "icon": "fab fa-bootstrap",
        "description": [
          "Bootstrap is a front-end library maintained by Twitter for easily creating beautiful, intuitive web components. Bootstrap is one of the most popular libraries in the world, and for good reason.",
          "It helps with extensive documentation on templated components, easy-to-understand structures, and allows for easier design on responsive screen sizes."
        ],
        "link": "https://getbootstrap.com/",
        "subheading": "Pick your website up",
        "progress": "40",
        "level": "Familiar"
      },
      {
        "id": "Mongo",
        "title": "MongoDB",
        "icon": "devicon-mongodb-plain",
        "description": [
          "MongoDB is a non-relational database technology. Unlike relational databases, MongoDB utilizes objects and allows for a simpler way to represent non-uniform data.",
          "MongoDB is a great database to start with, as you don't need to learn SQL, and can instead use the simple but explanatory methods provided."
        ],
        "link": "https://www.mongodb.com/",
        "subheading": "Don't Let Structure Hold You Back",
        "progress": "50",
        "level": "Familiar"
      },
      {
        "id": "Oracle",
        "title": "Oracle DB",
        "icon": "devicon-oracle-plain",
        "description": [
          "OracleDB is a traditional, relational database. Relational DB's scale better than non-relational DB's typically, and utilize the SQL language for interaction.",
          "Oracle is a great DB technology to build out for scale, and is used by many enterprises for this reason. I've built out a mock DB in Oracle, and it is a great place to learn the ins and outs of SQL."
        ],
        "link": "https://www.oracle.com/database/",
        "subheading": "Enterprise SQL",
        "progress": "60",
        "level": "Familiar"
      },
      {
        "id": "Postgres",
        "title": "PostgreSQL",
        "icon": "devicon-postgresql-plain",
        "description": [
          "PostgreSQL is another relational DB technology, but utilizes elements of non-relational DB's to be more user friendly while still allowing for scale.",
          "PostgreSQL is a great, open-source, all-purpose DB for both starting out and for scaling up."
        ],
        "link": "https://www.postgresql.org/",
        "subheading": "Relational Data from the ground up",
        "progress": "40",
        "level": "Familiar"
      },
      {
        "id": "Docker",
        "title": "Docker",
        "icon": "fab fa-docker",
        "description": [
          "Docker helps with the often frustrating process of dependency management through containerization. It's a great tool for mocking environments, as well as for staging production applications.",
          "Docker and the usage of containers are becoming more and more prevalent, and it is a great way to be able to focus on development, and not on your environment."
        ],
        "link": "https://www.docker.com/",
        "subheading": "Containerize & ship",
        "progress": "40",
        "level": "Familiar"
      },
      {
        "id": "Express",
        "title": "Express",
        "icon": "devicon-express-original",
        "description": [
          "Express is a lightweight, backend framework that runs through NodeJS. It's great it's simple enough to pick up as a first back-end framework, but powerful enough to serve out large applications.",
          "Express is written in JavaScript, allowing full-stack developers to develop in JavaScript across both the front and back-end of an application."
        ],
        "link": "https://expressjs.com/",
        "subheading": "spin up servers fast",
        "progress": "40",
        "level": "Familiar"
      },
      {
        "id": "Meteor",
        "title": "Meteor",
        "icon": "devicon-meteor-plain",
        "description": [
          "A lot of development is managing the annoying stuff - such as authentication, authorization, deployment, and the like. Fortunately, tools like Meteor exist to help you focus on developing the business logic instead of the nitty-gritty.",
          "Meteor helps with an environment that supports plug-ins that makes the normally frustrating things like user account management simple and painless. It's a great thing to develop in for someone starting out."
        ],
        "link": "https://www.meteor.com/",
        "subheading": "Focus on the business logic",
        "progress": "40",
        "level": "Familiar"
      },
      {
        "id": "NodeJS",
        "title": "NodeJS",
        "icon": "fab fa-node-js",
        "description": [
          "NodeJS is an environment that took the front-end language of JavaScript and turned it into a powerful backend language. NodeJS is one of the biggest technology trends of the last few years, and has the largest communities for libraries.",
          "I highly recommend learning NodeJS, as it allows for a quick and easy way of doing full-stack development. MongoDB, Express, and NodeJS together make a great starter stack!"
        ],
        "link": "https://nodejs.org/en/",
        "subheading": "fullstack in one language",
        "progress": "70",
        "level": "Proficient"
      },
      {
        "id": "Java",
        "title": "Java",
        "icon": "fab fa-java",
        "description": [
          "Java is one of the most ubiquitous programming languages in existence. It's a good all-purpose language, and runs everything from huge enterprises down to toasters. Java is a great language to start out with the fundamentals of Object-Oriented Programming (OOP).",
          "Java is not the same as JavaScript, though the two do feature a similar syntax. Java is great for all sorts of projects, and is a good mix between user-control and abstraction."
        ],
        "link": "https://www.java.com/en/",
        "subheading": "Pick yourself up",
        "progress": "70",
        "level": "Proficient"
      },
      {
        "id": "Python",
        "title": "Python",
        "icon": "fab fa-python",
        "description": [
          "Python's beauty is its simplicity. Python is a very high level language, and reads more like English than other programming languages. Python is a great starting language to learn, or great to develop projects quickly with.",
          "Python's strengths as a language include: rapid development through it's forgiving syntax, powerful back-end frameworks like Django, and extensive libraries for data analysis."
        ],
        "link": "https://www.python.org/",
        "subheading": "Simpled but powerful",
        "progress": "60",
        "level": "Proficient"
      },
      {
        "id": "Typescript",
        "title": "Typescript",
        "icon": "devicon-typescript-plain",
        "description": [
          "TypeScript is an open-source language that builds on top of JavaScript to make it easier to scale. Maintained by Microsoft, it introduces error checking and other things to JavaScript, allowing for it to be more developer-friendly as the project scales.",
          "TypeScript is the basis for many large-scale front-end projects, most notably those that utilize the Angular framework."
        ],
        "link": "https://www.typescriptlang.org/",
        "subheading": "Javascript that scales",
        "progress": "60",
        "level": "Proficient"
      },
      {
        "id": "R",
        "title": "R",
        "icon": "fab fa-r-project",
        "description": [
          "R is a language for analysis of large sets of data. R has some of the best libraries for data visualization and data analysis, so it is incredibly useful to those interested in data science.",
          "R has a number of syntax differences from many other popular languages, so it can be harder to pick up compared to other languages."
        ],
        "link": "https://www.r-project.org/",
        "subheading": "Data is Power",
        "progress": "40",
        "level": "Familiar"
      },
      {
        "id": "C++",
        "title": "C++",
        "icon": "devicon-cplusplus-plain",
        "description": [
          "C++ is an extremely performant language that is used in many high-usage situations. It is extremely popular among enterprises due to its high performance, but it can be a bit harder to learn.",
          "C++ makes you manage memory more so than many other languages, and can be rather difficult to debug when things go wrong. Still, it's fast for a reason, and is a great skill to learn."
        ],
        "link": "http://www.cplusplus.com/",
        "subheading": "Performant Power",
        "progress": "40",
        "level": "Familiar"
      },
      {
        "id": "C",
        "title": "C",
        "icon": "devicon-c-plain",
        "description": [
          "C dials up the performance aspect of C++ at the cost of even less error checking. C is an extremely lightweight language, but can be incredibly difficult to learn for a beginner.",
          "Unlike most current languages, C does not do automatic memory management, which leaves the user to do it. Still, C is a great bridge between higher-level languages and the assembly code that underlies all languages."
        ],
        "link": "https://en.wikipedia.org/wiki/C_(programming_language)",
        "subheading": "Fast, ruthless, and efficient",
        "progress": "40",
        "level": "Familiar"
      },
      {
        "id": "Git",
        "title": "Git",
        "icon": "fab fa-git-alt",
        "description": [
          "Git is a version control system that provides the basis for platforms like Github and Gitlab. Git lends itself very well to Agile development, and helps with iterative development.",
          "Git is an absolutely essential technology for working in any large software development environment, as it is the basis for making incremental changes to a codebase."
        ],
        "link": "https://git-scm.com/",
        "subheading": "Branch into something new",
        "progress": "70",
        "level": "Proficient"
      },
      {
        "id": "Slack",
        "title": "Slack",
        "icon": "fab fa-slack",
        "description": [
          "Not solely a technical skill, Slack is a method of helping to manage the workplace. Slack is a great way to facilitate communication across members of a group, and allows for limitless customization via plug-ins.",
          "I've utilized Slack for a number of different projects and organizations, and it greatly helps to catalog all communications."
        ],
        "link": "https://slack.com/",
        "subheading": "Manage the workspace"
      },
      {
        "id": "Trello",
        "title": "Trello",
        "icon": "devicon-trello-plain",
        "description": [
          "Trello is a project management tool for seeing the bigger picture of the project. It opens transparency across group work, as you can see the status on all parts of the project.",
          "Trello is a great tool to manage projects, school, work, or even just your personal life."
        ],
        "link": "https://trello.com/en-US",
        "subheading": "See the big picture"
      },
      {
        "id": "StackOverflow",
        "title": "Stack Overflow",
        "icon": "fab fa-stack-overflow",
        "description": [
          "When things inevitably go horribly wrong during development, Stack Overflow is there for you. For seemingly every question you could ask, there already is a Stack Overflow thread with an answer already.",
          "Almost every question you have is just a Google search away, so it's a critical skill to get comfortable with early-on in your development career."
        ],
        "link": "https://stackoverflow.com/",
        "subheading": "The almanac of errors"
      },
      {
        "id": "VisualStudio",
        "title": "Visual Studio Code",
        "icon": "devicon-visualstudio-plain",
        "description": [
          "Visual Studio (paid) and Visual Studio Code (free) are phenomenal Integrated Development Environments (IDEs) that let you develop in all sorts of different languages with hundreds of different plug-ins. They make working on large projects manageable, even for beginners, and can do a number of different operations to speed up development.",
          "Visual Studio Code is my environment of choice, especially for beginners, as it makes a lot of the set-up of software much easier."
        ],
        "link": "https://code.visualstudio.com/",
        "subheading": "Worry about development, not your environment"
      }
    ],
    "skillsets": [
      {
        "title": "Front-end Web Development",
        "skills": ["HTML", "CSS", "JS", "Vue", "Angular", "Sass", "Bootstrap", "React"]
      },
      {
        "title": "Back-end Development",
        "skills": ["Git", "Oracle", "Mongo", "Postgres", "Docker", "Express", "Meteor"]
      },
      {
        "title": "Programming Languages",
        "skills": ["NodeJS", "Java", "Python", "Typescript", "R", "C++", "C"]
      },
      {
        "title": "The Modern Workplace",
        "skills": ["Slack", "Trello", "StackOverflow", "VisualStudio"]
      }
    ],
    "bullets": []
  },
  "personal": [
    {
      "skill": "Collaboration",
      "role": "Vice-President",
      "organization": "Sigma Phi Delta",
      "image": "sigmaphidelta.jpg",
      "description": [
        "Sigma Phi Delta is the premier international social-professional fraternity of engineers. As Vice-President of of the Beta-Kappa chapter of Sigma Phi Delta, I manage the professional side of the fraternity, overseeing five different professional chairs, including philanthropy, fundraising, academic, career development, and online presence.",
        "Sigma Phi Delta has helped me tremendously develop my leadership abilities, and I've found that helping others grow professionally has helped me better understand what it means to be a professional. As an exclusively engineering fraternity, I've learned what it means to be an engineer - to solve problems.",
        "It has helped me be a better collaborator because everything involves working together to achieve a common goal for the organization."
      ]
    },
    {
      "skill": "Responsibility",
      "role": "Gryphon",
      "organization": "Gryphon Society",
      "image": "gryphon.png",
      "description": [
        "Gryphons (Residential Assistants) serve as mentors, resource guides, and sometimes policy enforcers for their residents. I've learned a great deal about responsibility from being a Gryphon, including crisis management and interpersonal conflicts.",
        "Both this year and last year I served as a Gryphon in the Sayre Park Village apartments, where I coordinated bi-weekly programming events with other Gryphons."
      ]
    },
    {
      "skill": "Leadership",
      "role": "President",
      "organization": "Computer Science & Business Association",
      "image": "csba.png",
      "description": [
        "As President of the Computer Science & Business Association, I'm in charge of helping the students of the CSB major develop professionally and personally through working with other members of the executive board. It's been a great experience to get more in-depth knowledge about a number of different topics in the areas of business and technology.",
        "One of the most important things the CSBA does is our mentorship program, where we help first-year students with their transition from high school to college, including academic advising and help in furthering their professional goals through on-campus resource connection.",
        "Leading the CSBA has been a great way to learn how to manage a team, especially in the areas of delegation and team member trust."
      ]
    },
    {
      "skill": "Empathy",
      "role": "Lead TRAC Writing Fellow",
      "organization": "TRAC Program",
      "image": "trac.png",
      "description": [
        "Writing is often a point where we are vulnerable, as it can offer a window into our mind. For that reason, writing is oftentimes a scary endeavor, especially to those who aren't comfortable with their writing.",
        "The TRAC Program has been a great experience for me to better understand empathy through the writing process. Writing is communication on paper, and TRAC taught me that sometimes you must look beyond the words written on the paper to understand what's going on in someone's head. Sometimes, you need empathy as to where they're coming from, and how they might be feeling.",
        "As a Lead TRAC writing fellow for the intro engineering course in Fall 2019, I hope to share what I've learned about empathy, especially with regards to solving the underlying needs of others' problems - what engineering ultimately is."
      ]
    },
    {
      "skill": "Perspective",
      "role": "Global Citizen",
      "organization": "Global Citizenship Program",
      "image": "gcp.png",
      "description": [
        "The Global Citizenship Program has offered me tremendous perspective into what it means to be a conscientious and active citizen in the increasingly globalized world of tomorrow.",
        "GCP helps me bring a global mindset through all problems I may face, and this mindset helps me tackle issues from new angles. It's helped me see how I can act to be a positive force for the world, even if only my small corner of it."
      ]
    }
  ],
  "projects": [
    {
      "id": "preff",
      "title": "Preff",
      "image": "preff.png",
      "link": "https://www.preff.menu",
      "description": [
        "Preff is an entrepreneurial venture that I have been working on with friends Dom Allen, Jack Cunningham, and Cam Cipriano. Preff started as an idea for a meal-swipe app, but has since become the next way for people to meet up over a meal.",
        "Preff has changed and pivoted from idea to idea, and has taught me the invaluable experience of building products around user feedback.",
        "Preff has been helped tremendously by a number of Lehigh mentors from the Baker Institute for Entrepreneurship, Creativity, and Innovation. They've provided the Preff team with countless hours of mentorship, as well as networking opportunities and pitch nights.",
        "I'm currently working with my team members to build out the full Preff app, so if you're interested in beta-testing, please contact me below!"
      ],
      "total": "$8,500",
      "bullets": [
        { "prize": "$500", "date": "March 2018", "award": "Eureka! Pitch Competition - Stage 2" },
        { "prize": "$1000", "date": "Sept. 2018", "award": "Eureka! Pitch Competition - Stage 3" },
        { "prize": "$1000", "date": "March 2019", "award": "Eureka! Pitch Competition - Stage 3" },
        { "prize": "$5000", "date": "April 2019", "award": "Eureka! Pitch Competition - Joan F. & John M. Thalheimer '55 Grand Prize, Michael W. Levin ’87 Advanced Technology Award" },
        { "prize": "$1000", "date": "April 2019", "award": "Lehigh Valley Innovation and Collegiate Business Pitch Summit - 2nd Place" }
      ],
      "subheading": "Meeting up over a meal",
      "color": "#8B0B0B"
    },
    {
      "id": "flowchart",
      "title": "CSB Course Flowchart",
      "image": "flowchart.png",
      "link": "https://csb-flowchart.web.app",
      "icon": "fab fa-node-js",
      "description": [ 
        "The CSB course flowchart is a project which I inherited from an earlier CSB student, and remade to have greater functionality and updated course descriptions.",
        "The CSB course flowchart has information on minors, electives, and AP credit for the CSB major, is used by CSB students to help plan out their academic course load.",
        "I am currently rewriting this project in Vue, so that it can better manage state, and so that it can be more customizable for other academic departments who want something similar."
      ],
      "subheading": "Map out your academic future",
      "color": "#428bca"
    }
  ],
  "awards": [
    {
      "title": "Lehigh University Class of 1904 Scholarship",
      "date": "May 2020",
      "bullets": [
        "Members of the Class of 1904, looking forward to suitably commemorating their 50th reunion and desiring to make a substantial contribution toward the University’s growth conceived the idea of establishing a scholarship fund in honor of the class. The fund was formally turned over to the University on the occasion of the Golden Anniversary of the class in June 1954. The income from the fund is to be used to award a senior scholarship on the basis of character, scholarship, qualifications indicating promise of future leadership, and extracurricular activities."
      ]
    },
    {
      "title": "Lehigh University Contribution to Student Life Leadership Award",
      "date": "May 2020",
      "bullets": [
        "This award recognizes underclass students who have significantly contributed to the improvement of the quality of student life during their time at Lehigh. Criteria include: good academic standing and specific contributions to student life through involvement in campus activities, academic initiatives, student governance, community service, leadership and their pursuits to support and empower their peers."
      ]
    },
    {
      "title": "Phi Beta Kappa Initiate",
      "date": "April 2020",
      "bullets": [
        "Initiated as part of Lehigh University's 2020 initiate class",
        "The Phi Beta Kappa Society (ΦΒΚ) is the oldest academic honor society in the United States, and is often described as its most prestigious honor society, due to its long history and academic selectivity. Phi Beta Kappa aims to promote and advocate excellence in the liberal arts and sciences, and to induct the most outstanding students of arts and sciences at American colleges and universities. It was founded at the College of William and Mary on December 5, 1776 as the first collegiate Greek-letter fraternity and was among the earliest collegiate fraternal societies."
      ]
    },
    {
      "title": "Beta Gamma Sigma Initiate",
      "date": "April 2020",
      "bullets": [
        "Initiated as part of Lehigh University's Spring 2020 initiate class",
        "Founded in 1913, Beta Gamma Sigma is the international business honor society for AACSB-accredited schools, which are the top 5% of business school programs around the world. Inducted as students, BGS members go on to serve in critical leadership roles in corporate, entrepreneurial, government, non-profit, and academic sectors. Members currently reside in all 50 U. S. states and more than 190 countries. Notable members include Nobel Prize winners, Olympians, inventors, CEOs of major global companies and nonprofit organizations, deans of the top business schools, and others who are making the world a better place at all levels of contribution through social enterprise, service, and leadership. Beta Gamma Sigma is a proud member of the Association of College Honor Societies (ACHS)."
      ]
    },
    {
      "title": "Piazza Tech Tour Finalist",
      "date": "Aug. 2019",
      "bullets": [
        "Selected as one of 10 Finalists from 10,000 applicants for the Piazza Summer 2019 Tech Tour",
        "Piazza is an online educational technology platform that is utilized by 50,000 professors in 2,000 schools in more than 90 different countries"
      ]
    },
    {
      "title": "Lehigh CSB PwC Scholar",
      "date": "May 2019",
      "bullets": [
        "Awarded as one of two students to receive a $2,000 scholarship towards study abroad expenses",
        "Worked for PwC Czech Republic in Prague, Czechia, researching and developing a proof-of-concept Microsoft Excel blockchain plug-in"
      ]
    },
    {
      "title": "Tau Beta Pi Initiate",
      "date": "April 2019",
      "bullets": [
        "Initiated as part of Lehigh University's Spring 2019 initiate class",
        "Tau Beta Pi is the only engineering honor society representing the entire engineering profession. It is the nation's second-oldest honor society, founded at Lehigh University in 1885 to mark in a fitting manner those who have conferred honor upon their Alma Mater by distinguished scholarship and exemplary character as students in engineering, or by their attainments as alumni in the field of engineering, and to foster a spirit of liberal culture in engineering colleges. There are now collegiate chapters at 248 US colleges and universities, 44 active alumni chapters in 16 districts across the country, and a total initiated membership of approximately 594,000."
      ]
    },
    {
      "title": "Rossin Junior Fellow",
      "date": "April 2019",
      "bullets": [
        "Selected as one of three students by the Department of Computer Science & Engineering to represent the Class of 2021 in the RJF Honor Society",
        "I help represent the P.C. Rossin College of Engineering & Applied Sciences to prospective students through admissions events and admitted student days"
      ]
    },
    {
      "title": "Winner, Blockchain Design Prompt, Lehigh Valley Hacks",
      "date": "April 2018",
      "bullets": [
        "Prototyped an easy-to-use, fully functional virtual wallet device that allows transfer between ERC20 cryptocurrencies",
        "Designed the User Interface to balance usability with data privacy via anonymous, but recognizable, user icons"
      ]
    },
    {
      "title": "First Place, Wharton Undergraduate FinTech Hackathon",
      "date": "Feb. 2018",
      "bullets": [
        "Prototyped a money-management solution aimed at consumers for easy-to-use peer-to-peer lending",
        "Designed the User Interface to allow users for easy access to both peer users and their consumer bank"
      ]
    }
  ]
}